IDEA StatiCa Open Model
SectionStiffnesses.EccX Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 eccentricity in x-direction
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double EccX { get; set; }
Public Property EccX As Double
	Get
	Set
public:
property double EccX {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
SectionStiffnesses Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace